//Q: 这个Repository是干什么的？
//A: 通过制作一个网页应用项目来学习ASP.NET。

//Q: 什么是ASP.NET？
//A: 可以将其理解为一套开发框架，通过ASP.NET我们可以开发网页应用。

//Q: 这个网页应用项目有哪些需求？
//A: 项目要求为租碟店开发一款网页应用，用来管理客户和出租碟的状态。这个应用需求为：
  //1.有用户(User)管理系统，用户可以注册、登陆获取部分操作权限，非注册用户访问权限有限(如不能进行添加删除等操作)；
  //2.有导航条(NavigationBar)，包括NewRental、Customers、Movies三个页面以及用户信息；
  //3.Customers页面，页面将包括按页显示所有客户名、会员状态、添加删除客户操作选项和搜索条，添加客户操作将跳转至添加客户页面；
  //4.添加客户页面，页面将包括新客户信息表单和保存按钮，用户可以在这里添加新的客户信息，未满18岁的客户将无法添加；
  //5.Movies页面，页面于Customers页面相似，包括电影名、类别、添加删除操作选项和搜索条，添加电影将跳转至添加电影页面；
  //6.添加电影页面，于添加客户页面类似‘
  //7.NewRental页面，页面包括客户姓名、租借电影名和提交按钮，一旦电影被出租将在Movies页面中显示不可用。

//暂时想到这么多，最后更新2018/02/21
