### 什么是单页面应用？
//A: 单页面应用即指这个网页应用只有一个页面。通过动态向服务端发送http请求来获得api传回的数据包，根据这些数据完全进行本地渲染。这意味着，一个页面中的
  //一部分视图可以千变万化，只要服务端有对应的API即可。

//Q: 如何制作单页面应用？
//A: 单页面应用的核心在于如何解析数据，并根据数据包完全进行本地渲染。所以一个固定的框架是必须的。市面上有两个受欢迎的前端框架，Angular和Backbone.js
  //推荐学习Angular。如此一来，前端就更RazorView没什么关系了，学习ASP.NET MVC可以更加专注后端的Web Service，如API，剩下的交给前端去渲染。

  //ASP.NET目前可以通过jQuery和ajax技术强行制作单页面应用，但绝对不会有Angular框架好用。

  //下一步的学习录像分两条：
    //1.专注后端，学习Web Service(SOAP, IIS, TCP/IP, API)；
    //2.学习前端框架技术如Angular，jQuery，ajax，最终称为全栈工程师。

//暂时想到这么多，最后更新2018/04/02
